#+TITLE: Data Adquisition

* Function declaration

#+BEGIN_SRC python :session data :results replace drawer output :exports both :tangle data_adqisition.py
import requests
import io
from bs4 import BeautifulSoup
import pandas as pd
from tabulate import tabulate

def get_soup(url: str) -> BeautifulSoup:
    response = requests.get(url)
    return BeautifulSoup(response.content, 'html.parser')

def get_csv_from_url(url:str) -> pd.DataFrame:
    s=requests.get(url).content
    return pd.read_csv(io.StringIO(s.decode('utf-8')))

def print_tabulate(df: pd.DataFrame):
    print(tabulate(df, headers=df.columns, tablefmt='orgtbl'))


#+END_SRC

#+RESULTS:
:results:
:end:

** UANL

#+BEGIN_SRC python :session data :results replace drawer output
soup = get_soup(f"http://transparencia.uanl.mx/remuneraciones_mensuales/bxd.php?pag_act=2&id_area_form=2305&mya_det=112020")
table = soup.find_all("table")[1].find_all('a')
print(table)
#+END_SRC

#+RESULTS:
:results:
[<a href="bxd.php?pag_act=1&amp;id_area_form=2305&amp;mya_det=112020">1</a>, <a href="bxd.php?pag_act=3&amp;id_area_form=2305&amp;mya_det=112020">3</a>, <a href="bxd.php?pag_act=4&amp;id_area_form=2305&amp;mya_det=112020">4</a>, <a href="bxd.php?pag_act=5&amp;id_area_form=2305&amp;mya_det=112020">5</a>, <a href="bxd.php?pag_act=6&amp;id_area_form=2305&amp;mya_det=112020">6</a>, <a href="bxd.php?pag_act=7&amp;id_area_form=2305&amp;mya_det=112020">7</a>, <a href="bxd.php?pag_act=8&amp;id_area_form=2305&amp;mya_det=112020">8</a>, <a href="bxd.php?pag_act=9&amp;id_area_form=2305&amp;mya_det=112020">9</a>, <a href="bxd.php?pag_act=10&amp;id_area_form=2305&amp;mya_det=112020">10</a>, <a href="bxd.php?pag_act=11&amp;id_area_form=2305&amp;mya_det=112020">11</a>, <a href="bxd.php?pag_act=12&amp;id_area_form=2305&amp;mya_det=112020">12</a>]
:end:

#+BEGIN_SRC python :session data :results replace drawer output :exports both
from typing import List, Tuple

def limpiar_nombre_dependencia(nombre_sucio:str)->str:
    nombre_en_partes = nombre_sucio.split(' ')
    return ' '.join(nombre_en_partes[2:])

def obtener_cantidad_de_filas(df: pd.DataFrame)-> int:
    return len(df.index)

def limpiar_dato_sueldo(sueldo_txt: str)-> float:
    return float(sueldo_txt[2:].replace(",", ""))

def get_dependencias_uanl()-> Tuple[List,List[str],List[str]]:
    soup = get_soup(f"http://transparencia.uanl.mx/remuneraciones_mensuales/bxd.php")
    table = soup.find_all("table")[0].find_all('tr')
    listado_dependencias = [(option['value'], limpiar_nombre_dependencia(option.text)) for option in table[1].find_all("option")]
    listado_meses = [option['value'] for option in table[2].find_all('td')[0].find_all("option")]
    listado_anios = [option['value'] for option in table[2].find_all('td')[1].find_all("option")]
    return (listado_dependencias,listado_meses, listado_anios)

def get_pages(periodo: str, area: str)-> List[str]:
    soup = get_soup(f"http://transparencia.uanl.mx/remuneraciones_mensuales/bxd.php?pag_act=1&id_area_form={area}&mya_det={periodo}")
    try:
        links = soup.find_all("table")[1].find_all('a')
    except Exception as e:
        print(e)
        return []
    return ['1'] + [link.text for link in links]

def get_info_transparencia_uanl(periodo: str, area: str, page:int = 1) -> pd.DataFrame:
    soup = get_soup(f"http://transparencia.uanl.mx/remuneraciones_mensuales/bxd.php?pag_act={page}&id_area_form={area}&mya_det={periodo}")
    table = soup.find_all("table")
    try:
        table_row = table[2].find_all('tr')
        list_of_lists = [[row_column.text.strip() for row_column in row.find_all('td')] for row in table_row]
        df = pd.DataFrame(list_of_lists[1:], columns=list_of_lists[0])
        df["Sueldo Neto"] = df["Sueldo Neto"].transform(limpiar_dato_sueldo)
        df = df.drop(['Detalle'], axis=1)
    except Exception as e:
        print(f"pagina sin informacion a: {area}, per: {periodo}, page:{page}")
        print(e)
        df = pd.DataFrame()
    return df

def unir_datos(ldf: List[pd.DataFrame], dependencia:str, mes: str, anio:str) -> pd.DataFrame:
    if len(ldf) > 0:
        df = pd.concat(ldf)
        df["dependencia"] = [dependencia[1] for i in range(0, obtener_cantidad_de_filas(df))]
        df["mes"] = [mes for i in range(0, obtener_cantidad_de_filas(df))]
        df["anio"] = [anio for i in range(0, obtener_cantidad_de_filas(df))]
    else:
        df= pd.DataFrame()
    return df
listado_dependencias, listado_meses, listado_anios = get_dependencias_uanl()


ldfs = []
for anio in listado_anios:
    for mes in listado_meses:
        for dependencia in listado_dependencias:
            pages = get_pages(f"{mes}{anio}", dependencia[0])
            print(f"m: {mes} a: {anio} d: {dependencia} p: {pages}")
            ldf = [get_info_transparencia_uanl(f"{mes}{anio}", dependencia[0], page) for page in pages]
            udf = unir_datos(ldf, dependencia, mes, anio)
            ldfs.append(udf)
df = pd.concat(ldfs)
df.to_csv("uanl.csv", index=False)
#+END_SRC

#+RESULTS:
:results:
:end:


#+BEGIN_SRC python :session data :results replace drawer output :exports both

df = pd.read_csv("uanl.csv")
df["dependencia"] = ["RECTORIA" for i in range(0, obtener_cantidad_de_filas(df))]
df["mes"] = ["10" for i in range(0, obtener_cantidad_de_filas(df))]
df["anio"] = ["2020" for i in range(0, obtener_cantidad_de_filas(df))]
df["Sueldo Neto"] = df["Sueldo Neto"].transform(limpiar_dato_sueldo)
print_tabulate(df)
#+END_SRC

#+RESULTS:
:results:
16425.2
|    | Nombre                              |   Sueldo Neto | dependencia   |   mes |   anio |
|----+-------------------------------------+---------------+---------------+-------+--------|
|  0 | ALBERTINA DAVILA PUENTE             |      16425.3  | RECTORIA      |    10 |   2020 |
|  1 | AMELIA GRACIELA MARTINEZ DE LA PENA |      13645    | RECTORIA      |    10 |   2020 |
|  2 | AURORA MARINA GOMEZ GUZMAN          |       6105.07 | RECTORIA      |    10 |   2020 |
|  3 | CARLOS RAFAEL PALOMO ARREDONDO      |       6045.57 | RECTORIA      |    10 |   2020 |
|  4 | CARMEN ALEJANDRA RAMIREZ GONZALEZ   |       6105.07 | RECTORIA      |    10 |   2020 |
|  5 | ELIZABETH REYES REYES               |      10526    | RECTORIA      |    10 |   2020 |
|  6 | ELSA YADIRA QUEZADA DE LA CRUZ      |      17131.8  | RECTORIA      |    10 |   2020 |
|  7 | HECTOR MANUEL ALMEIDA KAT           |      17252.2  | RECTORIA      |    10 |   2020 |
|  8 | JESUS VARGAS ROMERO                 |      10499.4  | RECTORIA      |    10 |   2020 |
|  9 | JORGE ALBERTO MORENO MORALES        |      38638.2  | RECTORIA      |    10 |   2020 |
| 10 | JORGE HUMBERTO CISNEROS GONZALEZ    |      30301.8  | RECTORIA      |    10 |   2020 |
| 11 | JUAN ISIDRO GONZALEZ FLORES         |       9695.07 | RECTORIA      |    10 |   2020 |
| 12 | MARIA CRISTINA RODRIGUEZ BRIONES    |       8136.83 | RECTORIA      |    10 |   2020 |
| 13 | MARIA GUADALUPE MEJIA RODRIGUEZ     |      16455    | RECTORIA      |    10 |   2020 |
| 14 | MAYRA THELMA COVARRUBIAS MARTINEZ   |      66103.2  | RECTORIA      |    10 |   2020 |
| 15 | NANCY PATRICIA SAUCEDO HERNANDEZ    |       5802.67 | RECTORIA      |    10 |   2020 |
| 16 | OLGA DEL SOCORRO ALMARAZ CORTES     |      22997.6  | RECTORIA      |    10 |   2020 |
| 17 | PATRICIA ELENA NIÑO GONZALEZ        |       9605.71 | RECTORIA      |    10 |   2020 |
| 18 | ROGELIO GUILLERMO GARZA RIVERA      |      76717.4  | RECTORIA      |    10 |   2020 |
| 19 | VERONICA DANIELA ARREDONDO ARIAS    |       8140.14 | RECTORIA      |    10 |   2020 |
| 20 | VICTOR EDUARDO SANCHEZ PLASCENCIA   |      74360.5  | RECTORIA      |    10 |   2020 |
:end:


** wiki
#+BEGIN_SRC python :session data :results replace drawer output :exports both
def wiki() -> pd.DataFrame:
    soup = get_soup("https://en.wikipedia.org/wiki/List_of_states_of_Mexico")
    list_of_lists = [] # :List
    rows = soup.table.find_all('tr')
    for row in rows[1:]:
        columns = row.find_all('td')
        #  listado_de_valores_en_columnas = []
        #  for column in columns:
        #    listado_de_valores_en_columnas.append(coulmn.text.strip())
        listado_de_valores_en_columnas = [column.text.strip() for column in columns]
        list_of_lists.append(listado_de_valores_en_columnas)

    return pd.DataFrame(list_of_lists, columns=[header.text.strip() for header in  rows[0].find_all('th')])


df = wiki()
print_tabulate(df)
df.to_csv("estados.csv", index=False)
#+END_SRC

#+RESULTS:
:results:
|    | State               | Official name (except Mexico City):                                   | Coat of arms | Capital                   | Largest city              | Area[6]                                | Population (2020)[7] | Municipalities | Order of Admissionto Federation | Date of Admissionto Federation |
|    |                     | Estado Libre y Soberano de (English: "Free and Sovereign State of") : |              |                           |                           |                                        |                      |                |                                 |                                |
|----+---------------------+-----------------------------------------------------------------------+--------------+---------------------------+---------------------------+----------------------------------------+----------------------+----------------+---------------------------------+--------------------------------|
|  0 | Aguascalientes      | Aguascalientes                                                        |              | Aguascalientes            | Aguascalientes            | 005615.75,615.7 km2 (2,168.2 sq mi)    | 014256071,425,607    |             11 |                            2424 | 185702051857-02-05[8]          |
|  1 | Baja California     | Baja California                                                       |              | Mexicali                  | Tijuana                   | 071450.071,450.0 km2 (27,587.0 sq mi)  | 037690203,769,020    |              6 |                            2929 | 195201161952-01-16[9]          |
|  2 | Baja California Sur | Baja California Sur                                                   |              | La Paz                    | La Paz                    | 073909.473,909.4 km2 (28,536.6 sq mi)  | 00798447798,447      |              5 |                            3131 | 197410081974-10-08[10]         |
|  3 | Campeche            | Campeche                                                              |              | San Francisco de Campeche | San Francisco de Campeche | 057484.957,484.9 km2 (22,195.0 sq mi)  | 00928363928,363      |             13 |                            2525 | 186304291863-04-29[11]         |
|  4 | Chiapas             | Chiapas                                                               |              | Tuxtla Gutiérrez          | Tuxtla Gutiérrez          | 073311.073,311.0 km2 (28,305.5 sq mi)  | 055438285,543,828    |            124 |                            1919 | 182409141824-09-14[12]         |
|  5 | Chihuahua           | Chihuahua                                                             |              | Chihuahua                 | Ciudad Juárez             | 247412.6247,412.6 km2 (95,526.5 sq mi) | 037418693,741,869    |             67 |                            1818 | 182407061824-07-06[12]         |
|  6 | Mexico City         | Ciudad de México                                                      |              | N/A                       | N/A                       | 001494.31,494.3 km2 (577.0 sq mi)      | 092099449,209,944    |             16 |                            3232 | 182409142016-01-29             |
|  7 | Coahuila1 4         | Coahuila de Zaragoza                                                  |              | Saltillo                  | Saltillo                  | 151594.8151,594.8 km2 (58,531.1 sq mi) | 031467713,146,771    |             38 |                            1616 | 182405071824-05-07[12]         |
|  8 | Colima6             | Colima                                                                |              | Colima                    | Manzanillo                | 005626.95,626.9 km2 (2,172.6 sq mi)    | 00731391731,391      |             10 |                            2323 | 185609121856-09-12[13]         |
|  9 | Durango             | Durango                                                               |              | Victoria de Durango       | Victoria de Durango       | 123364.0123,364.0 km2 (47,631.1 sq mi) | 018326501,832,650    |             39 |                            1717 | 182405221824-05-22[12]         |
| 10 | Guanajuato          | Guanajuato                                                            |              | Guanajuato                | León                      | 030606.730,606.7 km2 (11,817.3 sq mi)  | 061669346,166,934    |             46 |                             022 | 182312201823-12-20[12]         |
| 11 | Guerrero            | Guerrero                                                              |              | Chilpancingo              | Acapulco                  | 063595.963,595.9 km2 (24,554.5 sq mi)  | 035406853,540,685    |             81 |                            2121 | 184910271849-10-27[14]         |
| 12 | Hidalgo             | Hidalgo                                                               |              | Pachuca                   | Pachuca                   | 020821.420,821.4 km2 (8,039.2 sq mi)   | 030828413,082,841    |             84 |                            2626 | 186901161869-01-16[15]         |
| 13 | Jalisco             | Jalisco                                                               |              | Guadalajara               | Guadalajara               | 078595.978,595.9 km2 (30,346.0 sq mi)  | 083481518,348,151    |            125 |                             099 | 182312231823-12-23[12]         |
| 14 | México              | México                                                                |              | Toluca de Lerdo           | Ecatepec de Morelos       | 022351.822,351.8 km2 (8,630.1 sq mi)   | 1699241816,992,418   |            125 |                             011 | 182312201823-12-20[12]         |
| 15 | Michoacán           | Michoacán de Ocampo                                                   |              | Morelia                   | Morelia                   | 058598.758,598.7 km2 (22,625.1 sq mi)  | 047488464,748,846    |            113 |                             055 | 182312221823-12-22[12]         |
| 16 | Morelos             | Morelos                                                               |              | Cuernavaca                | Cuernavaca                | 004878.94,878.9 km2 (1,883.8 sq mi)    | 019715201,971,520    |             36 |                            2727 | 186904171869-04-17[16]         |
| 17 | Nayarit             | Nayarit                                                               |              | Tepic                     | Tepic                     | 027856.527,856.5 km2 (10,755.5 sq mi)  | 012354561,235,456    |             20 |                            2828 | 191701261917-01-26[17]         |
| 18 | Nuevo León4         | Nuevo León                                                            |              | Monterrey                 | Monterrey                 | 064156.264,156.2 km2 (24,770.8 sq mi)  | 057844425,784,442    |             51 |                            1515 | 182405071824-05-07[12]         |
| 19 | Oaxaca              | Oaxaca                                                                |              | Oaxaca                    | Oaxaca                    | 093757.693,757.6 km2 (36,200.0 sq mi)  | 041321484,132,148    |            570 |                             033 | 182312211823-12-21[12]         |
| 20 | Puebla              | Puebla                                                                |              | Puebla                    | Puebla                    | 034309.634,309.6 km2 (13,247.0 sq mi)  | 065832786,583,278    |            217 |                             044 | 182312211823-12-21[12]         |
| 21 | Querétaro           | Querétaro de Arteaga                                                  |              | Querétaro                 | Querétaro                 | 011690.611,690.6 km2 (4,513.8 sq mi)   | 023684672,368,467    |             18 |                            1111 | 182312231823-12-23[12]         |
| 22 | Quintana Roo        | Quintana Roo                                                          |              | Chetumal                  | Cancún                    | 044705.244,705.2 km2 (17,260.8 sq mi)  | 018579851,857,985    |             11 |                            3030 | 197410081974-10-08[18]         |
| 23 | San Luis Potosí     | San Luis Potosí                                                       |              | San Luis Potosí           | San Luis Potosí           | 061138.061,138.0 km2 (23,605.5 sq mi)  | 02,8222552,822,255   |             58 |                             066 | 182312221823-12-22[12]         |
| 24 | Sinaloa             | Sinaloa                                                               |              | Culiacán                  | Culiacán                  | 057365.457,365.4 km2 (22,148.9 sq mi)  | 030269433,026,943    |             18 |                            2020 | 183010141830-10-14[19]         |
| 25 | Sonora2             | Sonora                                                                |              | Hermosillo                | Hermosillo                | 179354.7179,354.7 km2 (69,249.2 sq mi) | 029448402,944,840    |             72 |                            1212 | 182401101824-01-10[12]         |
| 26 | Tabasco5            | Tabasco                                                               |              | Villahermosa              | Villahermosa              | 024730.924,730.9 km2 (9,548.7 sq mi)   | 024025982,402,598    |             17 |                            1313 | 182402071824-02-07[12]         |
| 27 | Tamaulipas4         | Tamaulipas                                                            |              | Ciudad Victoria           | Reynosa                   | 080249.380,249.3 km2 (30,984.4 sq mi)  | 035277353,527,735    |             43 |                            1414 | 182402071824-02-07[12]         |
| 28 | Tlaxcala            | Tlaxcala                                                              |              | Tlaxcala                  | San Pablo del Monte       | 003996.63,996.6 km2 (1,543.1 sq mi)    | 013429771,342,977    |             60 |                            2222 | 185612091856-12-09[20]         |
| 29 | Veracruz            | Veracruz deIgnacio de la Llave                                        |              | Xalapa                    | Veracruz                  | 071823.571,823.5 km2 (27,731.2 sq mi)  | 080625798,062,579    |            212 |                             077 | 182312221823-12-22[12]         |
| 30 | Yucatán3            | Yucatán                                                               |              | Mérida                    | Mérida                    | 039524.439,524.4 km2 (15,260.5 sq mi)  | 023208982,320,898    |            106 |                             088 | 182312231823-12-23[12]         |
| 31 | Zacatecas           | Zacatecas                                                             |              | Zacatecas                 | Guadalupe                 | 075275.375,275.3 km2 (29,064.0 sq mi)  | 016221381,622,138    |             58 |                            1010 | 182312231823-12-23[12]         |
:end:

#+BEGIN_SRC python :session data :results replace drawer output :exports both
from typing import Tuple

df = pd.read_csv("estados.csv")
df = df.drop(['Coat of arms'], axis=1)
# print(df.columns)
df.columns = ['estado',
       'nombre_oficial',
       'capital', 'ciudad_mas_grande', 'area', 'poblacion_2020',
       'num_de_municipios', 'lugar',
       'fecha_de_admision']
# print(df.columns)
print_tabulate(df)
df.to_csv("estados_limpio.csv", index=False)

#+END_SRC

#+RESULTS:
:results:
Index(['State',
       'Official name (except Mexico City):\nEstado Libre y Soberano de (English: "Free and Sovereign State of") :',
       'Capital', 'Largest city', 'Area[6]', 'Population (2020)[7]',
       'Municipalities', 'Order of Admissionto Federation',
       'Date of Admissionto Federation'],
      dtype='object')
|    | State               | col2                           | Capital                   | Largest city              | Area[6]                                | Population (2020)[7]   |   col7 |   col8 | col9                   |
|----+---------------------+--------------------------------+---------------------------+---------------------------+----------------------------------------+------------------------+--------+--------+------------------------|
|  0 | Aguascalientes      | Aguascalientes                 | Aguascalientes            | Aguascalientes            | 005615.75,615.7 km2 (2,168.2 sq mi)    | 014256071,425,607      |     11 |   2424 | 185702051857-02-05[8]  |
|  1 | Baja California     | Baja California                | Mexicali                  | Tijuana                   | 071450.071,450.0 km2 (27,587.0 sq mi)  | 037690203,769,020      |      6 |   2929 | 195201161952-01-16[9]  |
|  2 | Baja California Sur | Baja California Sur            | La Paz                    | La Paz                    | 073909.473,909.4 km2 (28,536.6 sq mi)  | 00798447798,447        |      5 |   3131 | 197410081974-10-08[10] |
|  3 | Campeche            | Campeche                       | San Francisco de Campeche | San Francisco de Campeche | 057484.957,484.9 km2 (22,195.0 sq mi)  | 00928363928,363        |     13 |   2525 | 186304291863-04-29[11] |
|  4 | Chiapas             | Chiapas                        | Tuxtla Gutiérrez          | Tuxtla Gutiérrez          | 073311.073,311.0 km2 (28,305.5 sq mi)  | 055438285,543,828      |    124 |   1919 | 182409141824-09-14[12] |
|  5 | Chihuahua           | Chihuahua                      | Chihuahua                 | Ciudad Juárez             | 247412.6247,412.6 km2 (95,526.5 sq mi) | 037418693,741,869      |     67 |   1818 | 182407061824-07-06[12] |
|  6 | Mexico City         | Ciudad de México               | nan                       | nan                       | 001494.31,494.3 km2 (577.0 sq mi)      | 092099449,209,944      |     16 |   3232 | 182409142016-01-29     |
|  7 | Coahuila1 4         | Coahuila de Zaragoza           | Saltillo                  | Saltillo                  | 151594.8151,594.8 km2 (58,531.1 sq mi) | 031467713,146,771      |     38 |   1616 | 182405071824-05-07[12] |
|  8 | Colima6             | Colima                         | Colima                    | Manzanillo                | 005626.95,626.9 km2 (2,172.6 sq mi)    | 00731391731,391        |     10 |   2323 | 185609121856-09-12[13] |
|  9 | Durango             | Durango                        | Victoria de Durango       | Victoria de Durango       | 123364.0123,364.0 km2 (47,631.1 sq mi) | 018326501,832,650      |     39 |   1717 | 182405221824-05-22[12] |
| 10 | Guanajuato          | Guanajuato                     | Guanajuato                | León                      | 030606.730,606.7 km2 (11,817.3 sq mi)  | 061669346,166,934      |     46 |     22 | 182312201823-12-20[12] |
| 11 | Guerrero            | Guerrero                       | Chilpancingo              | Acapulco                  | 063595.963,595.9 km2 (24,554.5 sq mi)  | 035406853,540,685      |     81 |   2121 | 184910271849-10-27[14] |
| 12 | Hidalgo             | Hidalgo                        | Pachuca                   | Pachuca                   | 020821.420,821.4 km2 (8,039.2 sq mi)   | 030828413,082,841      |     84 |   2626 | 186901161869-01-16[15] |
| 13 | Jalisco             | Jalisco                        | Guadalajara               | Guadalajara               | 078595.978,595.9 km2 (30,346.0 sq mi)  | 083481518,348,151      |    125 |     99 | 182312231823-12-23[12] |
| 14 | México              | México                         | Toluca de Lerdo           | Ecatepec de Morelos       | 022351.822,351.8 km2 (8,630.1 sq mi)   | 1699241816,992,418     |    125 |     11 | 182312201823-12-20[12] |
| 15 | Michoacán           | Michoacán de Ocampo            | Morelia                   | Morelia                   | 058598.758,598.7 km2 (22,625.1 sq mi)  | 047488464,748,846      |    113 |     55 | 182312221823-12-22[12] |
| 16 | Morelos             | Morelos                        | Cuernavaca                | Cuernavaca                | 004878.94,878.9 km2 (1,883.8 sq mi)    | 019715201,971,520      |     36 |   2727 | 186904171869-04-17[16] |
| 17 | Nayarit             | Nayarit                        | Tepic                     | Tepic                     | 027856.527,856.5 km2 (10,755.5 sq mi)  | 012354561,235,456      |     20 |   2828 | 191701261917-01-26[17] |
| 18 | Nuevo León4         | Nuevo León                     | Monterrey                 | Monterrey                 | 064156.264,156.2 km2 (24,770.8 sq mi)  | 057844425,784,442      |     51 |   1515 | 182405071824-05-07[12] |
| 19 | Oaxaca              | Oaxaca                         | Oaxaca                    | Oaxaca                    | 093757.693,757.6 km2 (36,200.0 sq mi)  | 041321484,132,148      |    570 |     33 | 182312211823-12-21[12] |
| 20 | Puebla              | Puebla                         | Puebla                    | Puebla                    | 034309.634,309.6 km2 (13,247.0 sq mi)  | 065832786,583,278      |    217 |     44 | 182312211823-12-21[12] |
| 21 | Querétaro           | Querétaro de Arteaga           | Querétaro                 | Querétaro                 | 011690.611,690.6 km2 (4,513.8 sq mi)   | 023684672,368,467      |     18 |   1111 | 182312231823-12-23[12] |
| 22 | Quintana Roo        | Quintana Roo                   | Chetumal                  | Cancún                    | 044705.244,705.2 km2 (17,260.8 sq mi)  | 018579851,857,985      |     11 |   3030 | 197410081974-10-08[18] |
| 23 | San Luis Potosí     | San Luis Potosí                | San Luis Potosí           | San Luis Potosí           | 061138.061,138.0 km2 (23,605.5 sq mi)  | 02,8222552,822,255     |     58 |     66 | 182312221823-12-22[12] |
| 24 | Sinaloa             | Sinaloa                        | Culiacán                  | Culiacán                  | 057365.457,365.4 km2 (22,148.9 sq mi)  | 030269433,026,943      |     18 |   2020 | 183010141830-10-14[19] |
| 25 | Sonora2             | Sonora                         | Hermosillo                | Hermosillo                | 179354.7179,354.7 km2 (69,249.2 sq mi) | 029448402,944,840      |     72 |   1212 | 182401101824-01-10[12] |
| 26 | Tabasco5            | Tabasco                        | Villahermosa              | Villahermosa              | 024730.924,730.9 km2 (9,548.7 sq mi)   | 024025982,402,598      |     17 |   1313 | 182402071824-02-07[12] |
| 27 | Tamaulipas4         | Tamaulipas                     | Ciudad Victoria           | Reynosa                   | 080249.380,249.3 km2 (30,984.4 sq mi)  | 035277353,527,735      |     43 |   1414 | 182402071824-02-07[12] |
| 28 | Tlaxcala            | Tlaxcala                       | Tlaxcala                  | San Pablo del Monte       | 003996.63,996.6 km2 (1,543.1 sq mi)    | 013429771,342,977      |     60 |   2222 | 185612091856-12-09[20] |
| 29 | Veracruz            | Veracruz deIgnacio de la Llave | Xalapa                    | Veracruz                  | 071823.571,823.5 km2 (27,731.2 sq mi)  | 080625798,062,579      |    212 |     77 | 182312221823-12-22[12] |
| 30 | Yucatán3            | Yucatán                        | Mérida                    | Mérida                    | 039524.439,524.4 km2 (15,260.5 sq mi)  | 023208982,320,898      |    106 |     88 | 182312231823-12-23[12] |
| 31 | Zacatecas           | Zacatecas                      | Zacatecas                 | Guadalupe                 | 075275.375,275.3 km2 (29,064.0 sq mi)  | 016221381,622,138      |     58 |   1010 | 182312231823-12-23[12] |
:end:

#+BEGIN_SRC python :session data :results replace drawer output :exports both
from typing import Tuple
import re
def limpiar_area(area:str)->Tuple[float,float]:
    str_en_partes = re.findall(r'[\d,\.]*', area)
    str_en_partes.remove('2')
    blancos = str_en_partes.count('')
    for blanco in range(0, blancos):
        str_en_partes.remove('')

    return str_en_partes
    #km_str = str_en_partes[0]
    #mi_str = str_en_partes[2]
    #return str_en_partes
print(limpiar_area('075275.375,275.3 km2 (29,064.0 sq mi)'))
#print_tabulate(df)
#+END_SRC

** csv
*** from file
#+BEGIN_SRC python :session data :results replace drawer output :exports both
df = pd.read_csv("/home/jhernandez/Sync/FCFMClases/21-1FJ/DataMining/dm_lmv_6.csv")
print_tabulate(df)
#+END_SRC
*** from url
#+BEGIN_SRC python :session data :results replace drawer output :exports both
df = get_csv_from_url("https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv")
print_tabulate(df)
df.to_csv("paises.csv", index=False)
#+END_SRC

#+RESULTS:
:results:
|     | Country                          | Region        |
|-----+----------------------------------+---------------|
|   0 | Algeria                          | AFRICA        |
|   1 | Angola                           | AFRICA        |
|   2 | Benin                            | AFRICA        |
|   3 | Botswana                         | AFRICA        |
|   4 | Burkina                          | AFRICA        |
|   5 | Burundi                          | AFRICA        |
|   6 | Cameroon                         | AFRICA        |
|   7 | Cape Verde                       | AFRICA        |
|   8 | Central African Republic         | AFRICA        |
|   9 | Chad                             | AFRICA        |
|  10 | Comoros                          | AFRICA        |
|  11 | Congo                            | AFRICA        |
|  12 | Congo, Democratic Republic of    | AFRICA        |
|  13 | Djibouti                         | AFRICA        |
|  14 | Egypt                            | AFRICA        |
|  15 | Equatorial Guinea                | AFRICA        |
|  16 | Eritrea                          | AFRICA        |
|  17 | Ethiopia                         | AFRICA        |
|  18 | Gabon                            | AFRICA        |
|  19 | Gambia                           | AFRICA        |
|  20 | Ghana                            | AFRICA        |
|  21 | Guinea                           | AFRICA        |
|  22 | Guinea-Bissau                    | AFRICA        |
|  23 | Ivory Coast                      | AFRICA        |
|  24 | Kenya                            | AFRICA        |
|  25 | Lesotho                          | AFRICA        |
|  26 | Liberia                          | AFRICA        |
|  27 | Libya                            | AFRICA        |
|  28 | Madagascar                       | AFRICA        |
|  29 | Malawi                           | AFRICA        |
|  30 | Mali                             | AFRICA        |
|  31 | Mauritania                       | AFRICA        |
|  32 | Mauritius                        | AFRICA        |
|  33 | Morocco                          | AFRICA        |
|  34 | Mozambique                       | AFRICA        |
|  35 | Namibia                          | AFRICA        |
|  36 | Niger                            | AFRICA        |
|  37 | Nigeria                          | AFRICA        |
|  38 | Rwanda                           | AFRICA        |
|  39 | Sao Tome and Principe            | AFRICA        |
|  40 | Senegal                          | AFRICA        |
|  41 | Seychelles                       | AFRICA        |
|  42 | Sierra Leone                     | AFRICA        |
|  43 | Somalia                          | AFRICA        |
|  44 | South Africa                     | AFRICA        |
|  45 | South Sudan                      | AFRICA        |
|  46 | Sudan                            | AFRICA        |
|  47 | Swaziland                        | AFRICA        |
|  48 | Tanzania                         | AFRICA        |
|  49 | Togo                             | AFRICA        |
|  50 | Tunisia                          | AFRICA        |
|  51 | Uganda                           | AFRICA        |
|  52 | Zambia                           | AFRICA        |
|  53 | Zimbabwe                         | AFRICA        |
|  54 | Afghanistan                      | ASIA          |
|  55 | Bahrain                          | ASIA          |
|  56 | Bangladesh                       | ASIA          |
|  57 | Bhutan                           | ASIA          |
|  58 | Brunei                           | ASIA          |
|  59 | Burma                            | ASIA          |
|  60 | Cambodia                         | ASIA          |
|  61 | China                            | ASIA          |
|  62 | East Timor                       | ASIA          |
|  63 | India                            | ASIA          |
|  64 | Indonesia                        | ASIA          |
|  65 | Iran                             | ASIA          |
|  66 | Iraq                             | ASIA          |
|  67 | Israel                           | ASIA          |
|  68 | Japan                            | ASIA          |
|  69 | Jordan                           | ASIA          |
|  70 | Kazakhstan                       | ASIA          |
|  71 | Korea, North                     | ASIA          |
|  72 | Korea, South                     | ASIA          |
|  73 | Kuwait                           | ASIA          |
|  74 | Kyrgyzstan                       | ASIA          |
|  75 | Laos                             | ASIA          |
|  76 | Lebanon                          | ASIA          |
|  77 | Malaysia                         | ASIA          |
|  78 | Maldives                         | ASIA          |
|  79 | Mongolia                         | ASIA          |
|  80 | Nepal                            | ASIA          |
|  81 | Oman                             | ASIA          |
|  82 | Pakistan                         | ASIA          |
|  83 | Philippines                      | ASIA          |
|  84 | Qatar                            | ASIA          |
|  85 | Russian Federation               | ASIA          |
|  86 | Saudi Arabia                     | ASIA          |
|  87 | Singapore                        | ASIA          |
|  88 | Sri Lanka                        | ASIA          |
|  89 | Syria                            | ASIA          |
|  90 | Tajikistan                       | ASIA          |
|  91 | Thailand                         | ASIA          |
|  92 | Turkey                           | ASIA          |
|  93 | Turkmenistan                     | ASIA          |
|  94 | United Arab Emirates             | ASIA          |
|  95 | Uzbekistan                       | ASIA          |
|  96 | Vietnam                          | ASIA          |
|  97 | Yemen                            | ASIA          |
|  98 | Albania                          | EUROPE        |
|  99 | Andorra                          | EUROPE        |
| 100 | Armenia                          | EUROPE        |
| 101 | Austria                          | EUROPE        |
| 102 | Azerbaijan                       | EUROPE        |
| 103 | Belarus                          | EUROPE        |
| 104 | Belgium                          | EUROPE        |
| 105 | Bosnia and Herzegovina           | EUROPE        |
| 106 | Bulgaria                         | EUROPE        |
| 107 | Croatia                          | EUROPE        |
| 108 | Cyprus                           | EUROPE        |
| 109 | Czech Republic                   | EUROPE        |
| 110 | Denmark                          | EUROPE        |
| 111 | Estonia                          | EUROPE        |
| 112 | Finland                          | EUROPE        |
| 113 | France                           | EUROPE        |
| 114 | Georgia                          | EUROPE        |
| 115 | Germany                          | EUROPE        |
| 116 | Greece                           | EUROPE        |
| 117 | Hungary                          | EUROPE        |
| 118 | Iceland                          | EUROPE        |
| 119 | Ireland                          | EUROPE        |
| 120 | Italy                            | EUROPE        |
| 121 | Latvia                           | EUROPE        |
| 122 | Liechtenstein                    | EUROPE        |
| 123 | Lithuania                        | EUROPE        |
| 124 | Luxembourg                       | EUROPE        |
| 125 | Macedonia                        | EUROPE        |
| 126 | Malta                            | EUROPE        |
| 127 | Moldova                          | EUROPE        |
| 128 | Monaco                           | EUROPE        |
| 129 | Montenegro                       | EUROPE        |
| 130 | Netherlands                      | EUROPE        |
| 131 | Norway                           | EUROPE        |
| 132 | Poland                           | EUROPE        |
| 133 | Portugal                         | EUROPE        |
| 134 | Romania                          | EUROPE        |
| 135 | San Marino                       | EUROPE        |
| 136 | Serbia                           | EUROPE        |
| 137 | Slovakia                         | EUROPE        |
| 138 | Slovenia                         | EUROPE        |
| 139 | Spain                            | EUROPE        |
| 140 | Sweden                           | EUROPE        |
| 141 | Switzerland                      | EUROPE        |
| 142 | Ukraine                          | EUROPE        |
| 143 | United Kingdom                   | EUROPE        |
| 144 | Vatican City                     | EUROPE        |
| 145 | Antigua and Barbuda              | NORTH AMERICA |
| 146 | Bahamas                          | NORTH AMERICA |
| 147 | Barbados                         | NORTH AMERICA |
| 148 | Belize                           | NORTH AMERICA |
| 149 | Canada                           | NORTH AMERICA |
| 150 | Costa Rica                       | NORTH AMERICA |
| 151 | Cuba                             | NORTH AMERICA |
| 152 | Dominica                         | NORTH AMERICA |
| 153 | Dominican Republic               | NORTH AMERICA |
| 154 | El Salvador                      | NORTH AMERICA |
| 155 | Grenada                          | NORTH AMERICA |
| 156 | Guatemala                        | NORTH AMERICA |
| 157 | Haiti                            | NORTH AMERICA |
| 158 | Honduras                         | NORTH AMERICA |
| 159 | Jamaica                          | NORTH AMERICA |
| 160 | Mexico                           | NORTH AMERICA |
| 161 | Nicaragua                        | NORTH AMERICA |
| 162 | Panama                           | NORTH AMERICA |
| 163 | Saint Kitts and Nevis            | NORTH AMERICA |
| 164 | Saint Lucia                      | NORTH AMERICA |
| 165 | Saint Vincent and the Grenadines | NORTH AMERICA |
| 166 | Trinidad and Tobago              | NORTH AMERICA |
| 167 | United States                    | NORTH AMERICA |
| 168 | Australia                        | OCEANIA       |
| 169 | Fiji                             | OCEANIA       |
| 170 | Kiribati                         | OCEANIA       |
| 171 | Marshall Islands                 | OCEANIA       |
| 172 | Micronesia                       | OCEANIA       |
| 173 | Nauru                            | OCEANIA       |
| 174 | New Zealand                      | OCEANIA       |
| 175 | Palau                            | OCEANIA       |
| 176 | Papua New Guinea                 | OCEANIA       |
| 177 | Samoa                            | OCEANIA       |
| 178 | Solomon Islands                  | OCEANIA       |
| 179 | Tonga                            | OCEANIA       |
| 180 | Tuvalu                           | OCEANIA       |
| 181 | Vanuatu                          | OCEANIA       |
| 182 | Argentina                        | SOUTH AMERICA |
| 183 | Bolivia                          | SOUTH AMERICA |
| 184 | Brazil                           | SOUTH AMERICA |
| 185 | Chile                            | SOUTH AMERICA |
| 186 | Colombia                         | SOUTH AMERICA |
| 187 | Ecuador                          | SOUTH AMERICA |
| 188 | Guyana                           | SOUTH AMERICA |
| 189 | Paraguay                         | SOUTH AMERICA |
| 190 | Peru                             | SOUTH AMERICA |
| 191 | Suriname                         | SOUTH AMERICA |
| 192 | Uruguay                          | SOUTH AMERICA |
| 193 | Venezuela                        | SOUTH AMERICA |
:end:
